In [3]:
import pandas as pd
import sqlite3

In [4]:
con = sqlite3.connect('sqlite-sakila.sq')
cursor = con.cursor()

In [5]:
actor = pd.read_sql_query("SELECT * from actor", con)
actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2011-09-14 18:05:28
1         2       NICK      WAHLBERG  2011-09-14 18:05:28
2         3         ED         CHASE  2011-09-14 18:05:28
3         4   JENNIFER         DAVIS  2011-09-14 18:05:28
4         5     JOHNNY  LOLLOBRIGIDA  2011-09-14 18:05:28